createCustomerAndAccount_19.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Convergys-Interface-ECA-Customer-WSDL" xmlns:urn1="urn:Convergys-Interface-ECA-Customer" xmlns:urn2="urn:Convergys-Interface-CommonIML" xmlns:urn3="urn:Convergys-Interface-ECA" xmlns:urn4="urn:Convergys-Interface-ECA-Contact" xmlns:urn5="urn:Convergys-Interface-ECA-Account" xmlns:urn6="urn:Convergys-Interface-ECA-Address">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:createCustomerAndAccount_19>
         <urn1:newCustomerData>
            <urn1:customerPK>
               <urn1:customerRef>:custReference</urn1:customerRef>
            </urn1:customerPK>
            <urn1:customerTypeId>1</urn1:customerTypeId>
            <urn1:concatenateBillsBoo>false</urn1:concatenateBillsBoo>
         </urn1:newCustomerData>
         <urn1:newAccountData>
            <urn5:accountPK>
               <urn5:accountNum>:acctNumber</urn5:accountNum>
            </urn5:accountPK>
            <urn5:customerPK>
               <urn1:customerRef>:custReference</urn1:customerRef>
            </urn5:customerPK>
            <urn5:currencyCode>GBP</urn5:currencyCode>
            <urn5:goLiveDtm>:startDate</urn5:goLiveDtm>
            <urn5:billStyleId>1</urn5:billStyleId>
            <urn5:paymentMethodId>5</urn5:paymentMethodId>
            <urn5:creditClassId>6</urn5:creditClassId>
            <urn5:prePayBoo>T</urn5:prePayBoo>
            <urn5:accountingMethod>1</urn5:accountingMethod>
            <urn5:billsPerStatement>1</urn5:billsPerStatement>
            <urn5:taxInclusiveBoo>false</urn5:taxInclusiveBoo>
            <urn5:defaultCPSId>:contractedPoSId</urn5:defaultCPSId>
            <urn5:autoDeleteBilledEventsBoo>false</urn5:autoDeleteBilledEventsBoo>
            <urn5:ustAccountClassId>3</urn5:ustAccountClassId>
            <urn5:invoicingCoId>5</urn5:invoicingCoId>            
            <urn5:billPeriodUnits>2</urn5:billPeriodUnits>            
            <urn5:billPeriod>1</urn5:billPeriod>            
            <urn5:nextBillDtm>:nextBillDate</urn5:nextBillDtm>
            <urn5:eventsPerDay>1</urn5:eventsPerDay>
            <urn5:maskBillBoo>false</urn5:maskBillBoo>
            <urn5:maskStoreBoo>false</urn5:maskStoreBoo>
            <urn5:reGuidedMaskBillBoo>false</urn5:reGuidedMaskBillBoo>
            <urn5:reGuidedMaskStoreBoo>false</urn5:reGuidedMaskStoreBoo>
            <urn5:languageId>1</urn5:languageId>
            <urn5:disableRealtimeBillBoo>false</urn5:disableRealtimeBillBoo>
            <urn5:outputEventToFileBoo>false</urn5:outputEventToFileBoo>
            <urn5:excludeFromPromoBoo>false</urn5:excludeFromPromoBoo>
            <urn5:creditCheckedBoo>false</urn5:creditCheckedBoo>
         </urn1:newAccountData>
         <urn1:newContactData>
            <urn4:contactTypeId>1</urn4:contactTypeId>
            <urn4:firstName>PR100298</urn4:firstName>
            <urn4:lastName>con1</urn4:lastName>
            <urn4:languageId>7</urn4:languageId>
            <urn4:newHistoriedContactData>
               <urn4:startDat>:startDate</urn4:startDat>
               <urn4:daytimeContactTel>1122334455</urn4:daytimeContactTel>
               <urn4:eveningExtension>44662</urn4:eveningExtension>
               <urn4:mobileContactTel>1122334455</urn4:mobileContactTel>
               <urn4:emailAddress>bhavya.mreto@netcracker.com</urn4:emailAddress>
            </urn4:newHistoriedContactData>
         </urn1:newContactData>
         <urn1:newAddressData>
            <urn6:countryId>18</urn6:countryId>
            <urn6:addressFormatId>1</urn6:addressFormatId>
            <urn6:zipcode>45678</urn6:zipcode>
            <urn6:addressLines>Test1</urn6:addressLines>
            <urn6:addressLines>Test2</urn6:addressLines>
            <urn6:addressLines>Test3</urn6:addressLines>
            <urn6:addressLines>Test4</urn6:addressLines>
            <urn6:addressLines>Test5</urn6:addressLines>
            <urn6:ustJcode>021100030</urn6:ustJcode>
            <urn6:ustIncityBoo>false</urn6:ustIncityBoo>
         </urn1:newAddressData>
         <urn1:assignHolidayProfileBoo>false</urn1:assignHolidayProfileBoo>
         <urn1:createDepositBalanceBoo>false</urn1:createDepositBalanceBoo>
      </urn:createCustomerAndAccount_19>
   </soapenv:Body>
</soapenv:Envelope>
